package edu.java.loop12;

public class LoopMain12 {

	public static void main(String[] args) {
		// for구문, while 구문을 모두 사용
		
		/* 1. 아래와 같이 출력되도록 코드 작성
		 	(출력 결과)
		 	*
		 	**
		 	***
		 	****
		 	*****
		 */

		/* 2. 아래와 같이 출력되도록 코드 작성
		 	(출력 결과)
		 	1꼬마 2꼬마 3꼬마 인디언
		 	4꼬마 5꼬마 6꼬마 인디언
		 	7꼬마 8꼬마 9꼬마 인디언
		 	10꼬마 인디언 소년~
		 */
		
		/* 3. 369게임 출력
		 	(출력 결과)
		 	1 2 * 4 5 * 7 8 * 10
		 	11 12 * 14 15 * 17 18 * 20
		 	21 22 * 24 25 * 27 28 * *
		 	* * * * * * * * * 40
		 	...
		 	* * * * * * * * * 100
		 */
	}

}
